app/Organizer.php

update `organizers` set `imagePath` = 'organizer-images/xsxsx-organization_27310.jpg', `organizers`.`updated_at` = '2019-12-05 19:12:28' where `id` = 5
---
    public static function saveFile($organizer, $request)
    {
        Storage::delete('public/' . $organizer->imagePath);
        $extension = $request->file('imagePath')->getClientOriginalExtension();
        $filename= $request->slug . '-' . 'organization' . '_' . rand(1,50000) .'.'.$extension;
        $imagePath = "organizer-images/$filename";
        $request->file('imagePath')->storeAs('/public/organizer-images', $filename);
        Image::make(storage_path()."/app/public/organizer-images/$filename")->fit(1200, 800)->save(storage_path("/app/public/$imagePath"));
        $organizer->update([ 'imagePath' => $imagePath ]);

select * from `organizers` where `organizers`.`user_id` = 1 and `organizers`.`user_id` is not null
---
    public static function getOrganizerEvents()
    {
        $organizers = auth()->user()->organizers->load([
            'liveEvents' => function ($builder) {
                $builder->where('user_id', auth()->id());
            },
            'pastEvents' => function ($builder) {
                $builder->where('user_id', auth()->id());
            },
            'inProgressEvents' => function ($builder) {
                $builder->where('user_id', auth()->id());
            }
        ]);