app/User.php

    public function getNeedsApprovalAttribute()
    {
        return auth()->user()->isAdmin() ? Event::where('approval_process', 'ready')->count() : null;
---
select count(*) as aggregate from `events` where `approval_process` = 'ready'