app/Http/Controllers/CategoryController.php

    public function index()
    {
        return Category::all();
---
select * from `categories`

    public function show(Category $category)
    {
        $category->load(['events' => function ($query) {
            $query->where('status', 'p');
        }]);
---
select * from `events` where `events`.`category_id` = 1 and `events`.`category_id` is not null