app/Http/Controllers/ContentAdvisoriesController.php

select * from `content_advisories` where `admin` = 1
---
    public function index()
    {
        return ContentAdvisory::where('admin', true)->get();