app/Http/Controllers/DescriptionController.php

    public function store(DescriptionStoreRequest $request, Event $event)
    {
        $event->update($request->except(['genre']));

        if ($request->has('genre')) {
            foreach ($request['genre'] as $genre) {
                Genre::firstOrCreate(['genre' => $genre]);
            };
            $newSync = Genre::all()->whereIn('genre', $request['genre']);
            $event->genres()->sync($newSync);
---
update `events` set `description` = 'T4est', `events`.`updated_at` = '2019-12-07 00:18:58' where `id` = 1
select * from `genres`
insert into `event_genre` (`event_id`, `genre_id`) values (1, 1)