app/Http/Controllers/EventController.php

select * from `shows` where `shows`.`event_id` in (1, 2, 3)
---
    public function indexfetch(Event $event)
    {
        $start = Carbon::now()->startOfWeek()->addDays(4);
        $end = Carbon::now()->startOfWeek()->addDays(6);
        $weekend = Event::search('*')
            ->where('closingDate', '>=', 'now/d')
            ->whereBetween('shows.date', [$start->format('Y-m-d H:i:s'),$end->format('Y-m-d H:i:s')])
            ->orderBy('published_at', 'desc')
            ->with(['location'])
            ->take(4)
            ->get();
        $horror = Event::search('*')
            ->where('closingDate', '>=', 'now/d')
            ->where('genres.name', 'horror')
            ->orderBy('published_at', 'desc')
            ->with(['location'])
            ->take(4)
            ->get();
        $events = Event::where('closingDate', '>=', Carbon::yesterday()->endOfDay())
            ->where('status', 'p')
            ->whereNotIn('id', $weekend->pluck('id')->concat($horror->pluck('id')))
            ->limit(4)
            ->get();