app/Http/Controllers/EventController.php

select * from `categories`
---
    public function index(Event $event)
    {
        $events = Event::search('*')
            ->where('closingDate', '>=', 'now/d')
            ->take(6)
            ->get();
        $categories = Category::all();

select * from `categories` where `categories`.`id` in (1)
select * from `locations` where `locations`.`event_id` in (1)
select * from `organizers` where `organizers`.`id` in (1)
---
    public function show(Event $event)
    {
        $event->load('category', 'organizer', 'location');