app/Http/Controllers/ExpectController.php

    public function store(ExpectationStoreRequest $request, Event $event)
    {
        $this->authorize('update', $event);
        $event->expectation->update($request->except(['contactLevel']));
        $event->contactlevels()->sync(request('contactLevel'));
---
insert into `contact_level_event` (`contact_level_id`, `event_id`) values (1, 1)