app/Http/Controllers/ExpectController.php

    public function store(ExpectationStoreRequest $request, Event $event)
    {
        $event->expectation->update($request->except(['contactLevel', 'contentAdvisory']));
        $event->contactlevels()->sync(request('contactLevel'));
        if ($request->has('contentAdvisory')) {
            foreach ($request['contentAdvisory'] as $content) {
                ContentAdvisory::firstOrCreate([
                    'advisories' => $content
                ],
                [
                    'user_id' => auth()->user()->id,
                ]);
            };
            $newSync = ContentAdvisory::all()->whereIn('advisories', $request['contentAdvisory']);
            $event->contentadvisories()->sync($newSync);
        };
        $event->update(['expectation_id' => $event->expectation->id]);
---
update `expects` set `wheelchairReady` = 0, `sexualViolence` = 0, `ageRestriction` = '12', `mobilityAdvisories` = 'xsxsx', `contactAdvisories` = 'dsxsxs', `expects`.`updated_at` = '2019-12-07 00:19:09' where `id` = 1
select * from `content_advisories`
insert into `content_advisory_event` (`content_advisory_id`, `event_id`) values (1, 1)
update `events` set `expectation_id` = 1, `events`.`updated_at` = '2019-12-07 00:19:09' where `id` = 1