app/Http/Controllers/LocationController.php

select * from `locations` where `locations`.`event_id` in (1)
select * from `regions`
select `regions`.*, `event_region`.`event_id` as `pivot_event_id`, `event_region`.`region_id` as `pivot_region_id` from `regions` inner join `event_region` on `regions`.`id` = `event_region`.`region_id` where `event_region`.`event_id` = 1
---
    public function create(Event $event)
    {
        //eager load location with $event variable
        $event->load('location');

        //load all the regions into the $region variable
        $regions = Region::all();

        // load the connection between event and region
        $pivots = $event->regions()->get();