app/Http/Controllers/ProfilesController.php

select * from `favorites` where `favorites`.`user_id` = 1 and `favorites`.`user_id` is not null
---
        public function show(User $user)
    {
        $fav = $user->favorites()->get();