app/Http/Controllers/RegionsController.php

    public function index()
    {
        return Region::all();
---
select * from `regions`