app/Http/Controllers/ShowsController.php

select * from `shows` where `shows`.`event_id` = 1 and `shows`.`event_id` is not null and `date` not in ('2019-12-06 00:00:0', '2019-12-07 00:00:0', '2019-12-08 00:00:0', '2019-12-09 00:00:0', '2019-12-11 00:00:0', '2019-12-27 00:00:0', '2019-12-28 00:00:0')
---
    public function store(ShowStoreRequest $request, Event $event)
    {
        $showDelete = $event->shows()->whereNotIn('date', $request->dates)->get();

update `events` set `show_times` = 'at 8:00', `closingDate` = '2019-12-28 00:00:00', `price_range` = '', `events`.`updated_at` = '2019-12-07 00:18:51' where `id` = 1
---
            $pricerange = '$' . $array[0];
        }

        $event->update([
            'closingDate' => $lastDate->date,
            'show_times' => $request->showtimes,
            'price_range' => $pricerange,
        ]);

select * from `shows` where `shows`.`event_id` = 1 and `shows`.`event_id` is not null
---
    public function loadShows(Event $event)
    {
        $tickets = $event->shows()->with('tickets')->get();